{"intents": [
        {"tag": "smartcard",
         "patterns": ["What information does a smart card DL issued in Bengaluru contain","What does smart card contain","What will be there in a smart card"],
         "responses": ["The information contained by a smart card driving license issued in Bengaluru comprises holders name, vehicle class, vehicle type, date of birth, address and others","holders name, vehicle class, vehicle type, date of birth, address and others."]
        },
	{"tag": "fee",
         "patterns": ["What is the application fee for availing a smart card DL in Bengaluru","How much does a smart card cost","What is the price of a smart card"],
         "responses": [" For availing a smart card DL in Bengaluru, one has to pay a fee of Rs. 200.","Rs.200","You have to pay Rs.200"]
        },
	{"tag": "status",
         "patterns": ["How can I know about my driving license status in Bengaluru","Where should I check my license status","How would I know what my driving status is"],
         "responses": ["Either you can check the status of the driving licence at the RTO","sarathi.nic.in.","At RTO Office"]
        },
	{"tag": "drivinglicensefee",
         "patterns": ["Is there any application fee for giving a driving license test in Bengaluru","What is the application fee for license test","How much should I pay for the application of driving license test"],
         "responses": ["The application fee for a driving license test in Bengaluru is Rs. 50.","Rs.50","Its just Rs.50","You just have to pay Rs.50"]
        },
	{"tag": "fail",
         "patterns": ["What happens if I fail my driving license test in Bengaluru","What do I do if I fail in the license test","Can I take retest if I fail once in the license test","How frequent can I take test if failed in license test"],
         "responses": ["On failing, one can re-appear for a retest in just 7 days","You can retake it after a week","You can try again in 7 days","Retest can be taken after a week"]
        },
	{"tag": "documents",
         "patterns": ["What documents should a driver carry when driving?","which documents should I carry while driving","Which documents are expected while driving","What are the required documents to drive","what documents do i carry while driving"],
         "responses": ["Driving license ,Taxation Certificate,Emission Test Certificate,Insurance Certificate,Fitness Certificate & Permit","Registration certificate,Taxation Certificate,,Emission Test Certificate,Insurance Certificate,Fitness Certificate & Permit"]
        },
	{"tag": "fine",
         "patterns": ["Who is authorized to collect the traffic fine on the spot","Who collects the traffic fine","Who has the authority to collect traffic fine"],
         "responses": ["Any traffic branch officer of and above the rank of Assistant Sub-Inspector of Police duly authorized with a receipt book","traffic branch officer with a receipt book","traffic branch officer of and above the rank of Assistant Sub-Inspector of Police duly authorized"]
        },
	{"tag": "notice",
         "patterns": ["What do I do if I have recieved a notice from the Traffic Enforcement Automation Centre"," What shall I do if I get a notice","Where should I go if I get a notice"],
         "responses": ["You can pay the fine at the #5, Traffic Head Quarters, 5th Floor, Enforcement Automation Centre, Infantry Road, Bengaluru 560001","at any of the 42 Traffic Police Stations in Bangalroe city","You can pay the fine at any of the Bengaluru-One centers as per your convenience"]
        },
	{"tag": "seatbelt",
         "patterns": ["What is the rule regarding seat belts","Is it binding using seat belts while driving in interior areas or bylanes","Who and all should wear a seat belt"],
         "responses": ["The driver and the person seated in the front seat must wear the seat belts while vehicle is in motion U/S 138 CMVR r/w 177 MVA","People sitting in the front seat should wear a seat belt","Seatbelt is a must for driver and the person sitting in the front seat"]
        },
	{"tag": "phone",
         "patterns": ["What is the rule for use of mobile phone","Can I use mobile phone while driving"],
         "responses": ["As per Section 230 (A) ,KMVR R/W Sec 177 ,I.M.V Act no driver while driving or riding a motor vehicle shall use a mobile phone","Driver of vehicle shouldn't use mobile phone","It is strictly not allowed to use a phone while driving"]
        },
	{"tag": "occupants",
         "patterns": ["Can other occupants of the motor vehicle use the mobile phone","Can people other than driver is allowed to use phone","people at back can take a call"],
         "responses": ["Yes. Other than driver, occupants of the motor vehicle can use mobile phone ","People other than driver can use a phone","Yes, You are allowed if you aren't the driver"]
        },
	{"tag": "doctor",
         "patterns": ["If I am a doctor can I use my mobile phone in an emergency while driving","Incase of emergency can I use phone while driving","If it is an urgency can mobile phone be used","Can anyone use phone if its urgent"],
         "responses": ["No. Exemption is not given to any one in the M.V Act or Rules regarding this","You can stop the vehicle and then take the call","In any of the cases you are not allowed to take a call while driving"]
        },
	{"tag": "accident",
         "patterns": ["What are the duties of a driver when his vehicle is involved in an accident resulting in death or bodily injury or damage to property","What should a driver do incase of accident","What steps are to be taken if a vehicle driver is involved in accident"],
         "responses": ["The duties are as under: · Arrange for medical help Inform the police · In case the vehicle is carrying dangerous goods, keep everyone away, avoid smoking in the vicinity and take emergency action as displayed on the vehicle","Take the victim to hospital and inform police","Inform to police and take injured to the hospital"]
        },
	{"tag": "towing",
         "patterns": ["Under what conditions is the towing of a vehicle allowed","In which cases does towing happen ","What happens if I park my vehicle in No parking zone"],
         "responses": ["Vehicle abandoned or left unattended or Parked in a parking restricted zone or Parked in a way causing inconvenience to other road user can be towed away.","If vehicle is parked in No parking area, it will be towed away","Vehicle can be towed away if it creates inconvenience to road users"]
        },
	{"tag": "liquor",
         "patterns": ["What is the punishment for drunken driving under the influence of any drug","What happens if a driver is drunk and drives","What is the punishment for drunk and drive"],
         "responses": ["If a driver is caught driving a vehicle with alcohol in his blood exceeding 30 mg per 100 ml or he is under the influence of a drug to such an extent that he is incapable of exercising proper control over the vehicle, the following will be Imprisoned up to 6 months","fine upto Rs.10,000","imprisonment upto 2 years or Rs.10,000","Sometimes both imprisonment(2 years/6 months) and fine(10,000)"]
        },
	{"tag": "detain",
         "patterns": ["When can the authorities detain a vehicle"],
         "responses": ["Vehicle being driven by an individual without valid driving license","Vehicle being driven without registration","Transport vehicle being driven without Permit","Vehicle being driven without payment of Tax "]
        },
	{"tag": "nolicense",
         "patterns": ["What are the consequences for driving without a license","What if I drive without a license","What is the punishment for driving without license"],
         "responses": ["fine of Rs.1000- 2 wheeler, Rs.2000-Non transport vehicle,Rs.5000-Transport vehicle","Fine varies from Rs.1000 to Rs.5000 based on your vehicle","Fine varies from 2 wheelers to transport vehicles starting from Rs.1000/-"]
        },
	{"tag": "Helmet",
         "patterns": ["Is wearing helmet compulsory for Scooter and Motorcycle riders","Is helmet compulsory for 2 wheelers"," Is helmet mandatory","What is the punishment for not wearing a helmet"],
         "responses": ["Wearing helmet is compulsory. Violators will be charged U/sec.177 of M.V.Act-1988 for which fine is Rs.500/- ","You should pay a fine of Rs.500","You will be fined","fine will be put on you"]
        },
	{"tag": "drunk",
         "patterns": ["What are the consequences of driving under influence of liquor","What will happen if I drive after I am fully drunk","What should I do if I am drunk and was driving"],
         "responses": ["If you are caught driving under the influence of liquor you will be issued a police notice for for the appearance in the Court. There is no provision of paying the fine on the spot. Moreover, you will not be allowed to continue to driving unless you have a partner who is not under the the influence of liquor and has a valid driving licence.","You will be advised to hire a cab leaving the vehicle in the police station under acknowledgement till you apear in the court and pay the fine. Your driving licence will also be kept with the police till the disposal of the case. You are reminded that on repeat offence of driving under the influence of liquor, there is a provision for enhanced penalty and imprisonment. If you commit a fatal accident under the influence of liquor you could be booked under culpable homicide not amounting to murder which is a non-bailable offence."]
        },
	{"tag": "inspection",
         "patterns": ["What document am I expected to carry","Which documents should I carry","What and all documents are required for inspection"],
         "responses": ["You are expected to carry original Driving license, RC book and Insurance certificate, all these documents should be carried in original or Smart card form. In addition transport vehicles like bus, taxi and auto rickshaws are expected to carry permit and fitness certificate. These documents should be produced for inspection if asked for by the police officer. "]
        },
	{"tag": "avoid",
         "patterns": ["Can I avoid carrying all these documents","Will it work without documents","Is there any chance to get work done without documents"],
         "responses": ["Yes. As per rule 87 (5) of Karnataka Motor Vehicle Rules, there is a provision of getting MASTER PASS for two/three/four wheelers from RTO which is a proof that the driver has all valid documents i.e. certificate of registration, taxation card, insurance certificate and driving license. In case one is carrying Master Pass he need not carry above documents. For transport vehicles like buses and lorry etc SPEED PASS can be obtained from RTO which is a proof that one has valid registration certificate, taxation card, fitness certificate, insurance certificate and permit etc. In case one is carrying Speed Pass he need not carry above documents. "]
        },
	{"tag": "spotfine",
         "patterns": ["Who can receive payment of spot fine","Who collects spot fine","To whom should I pay spot fine"],
         "responses": ["Only Asst. Sub-Inspector (one star), Police Sub-Inspector (two star) and Police Inspector (three star) are authorized to receive payments against violation and issue a receipt. No Police Constable or head constable can issue a receipt and therefore receive a payment. They can however record the violations on the basis of which violation ticket will follow. This ticket can be settled at any of the traffic police stations or Bengaluru-One center or on Bengaluru Traffic Police website. Incase a Constable or Head Constable threatens you with spot fine, insist on getting receipt and the chances are that he will let you go because he is not authorized to issue a receipt or receive money. "]
        },
	{"tag": "onspot",
         "patterns": ["What is the spot fine for drunken driving","What is the spot fine if I am drunk while driving","How much should driver under drunken state should pay"],
         "responses": ["There is no spot fine for drunken driving. In each of the drunken driving case, police notice is issued asking the person to appear before the court. Only court is empowered to impose the fine.","No spot fine is fined incase of drunk and drive","A police notice is issued.On spot fine is not imposed","Fine is imposed only in court"]
        },
	{"tag": "court",
         "patterns": ["What happens if I don’t appear in the court","which punishment is imposed if not appeared in court","What is the punishment for not appearing in court"],
         "responses": ["If you fail to appear in court, warrant will be issued from the court. This may lead to arrest and stiffer penalty.","Warrant is issued","arrest and penality"]
        },
	{"tag": "booked",
         "patterns": ["After being booked for drunken driving can I continue to drive myself","After a case is filed can i drive","Being booked for drunk and drive case can I drive my car"],
         "responses": ["No. you will have to arrange for an alternate driver who is not drunk or take a cab leaving the vehicle in the police station which will be released after you have settled the case in the court.","NO","you should take a driver or cab","no,You should take a driver or a cab"]
        },
	{"tag": "pollution",
         "patterns": ["What about pollution check","Is it mandatory to carry a pollution certificate","Should I carry pollution certificate while driving","Is pollution certificate a must"],
         "responses": ["It is mandatory to carry emission certificate. However, police have been instructed not to stop any motorists for merely checking emission certificate.","Emission certificate is a must","Police check for pollution certificate.So you must carry it"]
        },
	{"tag": "number",
         "patterns": ["Can police penalize vehicles with number plate of other State","will police fine penality if vehicles are of other places number plates","If my vehicle is not of bangalore will police charge penality"],
         "responses": ["No. police is not authorized to penalize any one for out Station number plates. This is not the mandate for police.","No","They are not authorized to charge for this reason"]
        },
	{"tag": "violation",
         "patterns": ["Why have I received a violation ticket for the vehicle I have already sold","What should i do if i receive violation ticket for my sold vehicle","I sold my vehicle and now i got a violation ticket of that vehice what should i do"],
         "responses": ["Notices are generated by computers picking up address from transport department records. The very fact you have received a notice means that vehicle continues to be on your name in the records even though you might have sold it. Selling the vehicle without insisting on change of ownership is a very dangerous practice. Signing a delivery note is no guarantee of change of ownership. You have to insist on buyer registering the vehicle in his name, failing which you have to get it done yourself at RTO. Unless you do so, you will continue to receive violation notices. Still worse can happen if the vehicle is involved in a fatal accident or terrorist activity. You will have to suffer the consequences."]
        },
	{"tag": "damaged",
         "patterns": ["My vehicle got damaged in an accident. Police did not help me in getting compensation","Why didnt police help to get compensation for my damaged vehicle in accident","my vehicle is damaged in an accident police didnt help me what should i do"],
         "responses": ["insurance company and not the police can get you the damages. Police will only prosecute the accused for criminal negligence in the court of law.","Police is not responsible for that","you should consult insurance company not police"]
        },
	{"tag": "traffic",
         "patterns": ["I crossed the stop line seeing green signal. But traffic in front of me was not moving and I got penalized","I got penalized for crossing the stop line after green signal and traffic wasnt cleared then what should i do","i was penalized for crossing stop light during green light but traffic was not cleared","why was i asked to pay fine when i crossed green light when the traffic was not moving","why was i penalized for crossing stop line on a green light"],
         "responses": ["Even if signal is green you should not enter the junction unless the tail of the traffic in front of you is moving. Otherwise you will create gridlock and block cross traffic too.","You should not move until the traffic before you is cleared","First you should let traffic before you clear only then you can enter the junction","you should pay fine as you have entered junction before the traffic infront of you has cleared"]
        },
	{"tag": "speed",
         "patterns": ["I dont see speed limit boards in the city","why are there no speed limit boards in the city","How do i know what the speed limit is inside the city"],
         "responses": ["As per notification, speed limit in entire city corporation limit is 50 kmph for LMV and 40 kmph for HMV. It is not possible to put boards all over 4000 km road length in city. Only where we have lower permissible speed like flyovers/narrow stretches / bends or higher permissible limits (Devanahalli road, Mysore Road and Ring Roadsetc) these boards are put. This is the practice world over. "]
        },
	{"tag": "noparking",
         "patterns": ["I got fined for parking violation But board was at least 20 m away from where I parked","Though my vehicle is 20m away from no parking board i was fined what should i do","I was charged fine even when my vehicle was parked far from no parking board why did this happen"],
         "responses": ["It is not possible to put one board for each vehicle. “No parking” is notified by gazette notifications and then boards are erected. Each board indicates that roughly 50 m each side of boards is no-parking area. That is why boards are put 100 m apart.","You should not park vehicle within 50 metres of no parking board","50m on each side of the no parking board is not allowed to park vehicles","you should not park vehicle within 50m range of no parking board"]
        },
	{"tag": "lights",
         "patterns": ["Why do traffic police switch off the lights during peak hours","i am driving at peak hours and traffic police switched off lights why","what is the reason for switching off lights in peak hours"],
         "responses": ["Actually it is not a good practice but is in-evitable due to inadequate capacity of junctions. There are the situation when road is not able to take the entire volume of traffic and tail of traffic ahead does not get cleared even till next green phase. Now if the lights are not switched off, vehicles will block the junction and make it impossible for even cross traffic to move thus creating a grid-lock. It is lose-lose situation for all. At this juncture policemen take over the signal and regulate it according to clearance and relative volume. However, this practice is largely reduced and will disappear soon due to increased capacity of roads and junctions. Switching off also becomes inevitable during acts of nature like water logging, cracks in road and man-made situations like strikes, rasta-rokho and VIP movement, when one or more roads become unavailable for traffic. In all such situations mannual operations are resorted to. This practice is, however not encouraged. "]
        },
	{"tag": "pay",
         "patterns": ["i dont want to pay spot fine What is the other option","what should i do if i am not willing to pay spot fine","i am not interested in paying on spot fine how should i manage"],
         "responses": ["If a violation refuses or does not want to pay a spot fine, he would be required to surrender his original driving licence - for which the officer concerned would give an acknowledgement. He can walk into the police station within a week pay the fine and get the DL back or the case will go to court, and the offender will have to go by the decision taken by it. In the absence of an original driving licence, the person will have to leave the vehicle with the police. If the motorist fails to appear in court, a warrant will be issued and he will have to face arrest or stiffer penalties."]
        },
	{"tag": "finenotice",
         "patterns": ["Among traffic officers, who is authorized to give a spot fine notice","who can issue spot fine notice","who has the authority to issue spot fine notice"],
         "responses": ["Traffic officers of and above the rank of assistant sub-inspector are authorised to give away traffic violation challans or notices, which are for spot fines. Officers of the rank of ASI (one-star), sub-inspector (two-star), inspector (three-star) are authorised to collect spot fines. Any officer below the rank of ASI, which comprises constables and head constables, can only note down the nature of violation and vehicle number, and submit the information to the traffic enforcement automation centre. Notices will then be issued from the centre. The violator will have to pay the fine at the jurisdictional police station, the nearest Bengaluru One centre or the Bengaluru traffic police website. Traffic constables are not authorised to collect money as they do not carry receipt books. The motorist may lodge a complaint if any officer below the rank of ASI collects money from him."]
        },
	{"tag": "criscross",
         "patterns": ["Why are junctions painted criscross in the center","junctions are printed criscross why","i dont understand why are junctions criscross"],
         "responses": ["Cris-Cross marking indicates “no standing”. Unless one is sure of clearing the junction, he should not enter the junction even if the signal light is green, because it will block the cross traffic and lead to grid-lock.","criscross indicates no standing."]
        },
	{"tag": "driving",
         "patterns": ["What are the documents one must carry while driving a vehicle","Which documents should i carry while driving","what and all documents are expected whilst driving"],
         "responses": ["A motorist has to carry the original driving licence and insurance certificate. Photocopies of documents won't be valid during police inspection after a violation has been committed. However, if a motorist doesn't want to carry his originals with him all the time, he can obtain a master pass from the nearest RTO. It can be obtained through the production of the certificate of registration, taxation card, insurance and driving licence. Once you have the master card, there is no need to carry other documents"]
        },
	{"tag": "motorist",
         "patterns": ["When can a motorist be charged with drunk driving What is the procedure for paying the fine","what is the punishment for motorist if he is drunk and is driving","what if a 2 wheeler driver undergoes drunk and drive"],
         "responses": ["A motorist caught driving under the influence of liquor beyond permissible limit is liable to be charged with the offence of drunken driving. Legal permissible limit is 30mg of alcohol per 100ml of blood. Traffic police uses state of art alco meters (breath analyzers) accepted worldwide to measure the level of alcohol in blood. This is scientifically and legally accepted method all over the world. Our instruments are calibrated once in three months with a probable error of  5 percent. Therefore, we do not panelize anyone below 40mg per 100ml of blood even though legal limit is only 30. Anyone driving with alcohol level below a reading of 40 is not repeat not liable for prosecution However everyone need not be subjected to measurement. Merely, by bringing the instruments close to mouth and asking name of the person indicates preliminary result whether the person has consumed alcohol are not. If the result is negative, no measurement is required and person is allowed to go. If the result is positive, measurement is done using the disposable straw and reading printed using connected printers. Subsequently, the blackberry generated police notice is given to the motorists. No one can be prosecuted without a computerized print out indicating reading and a blackberry print out of mentioning that reading.However there is no spot there are no spot for drunk driving. No police officer is allowed to collect spot fines for this offence. The person will be given a notice, will be sent to the court and the offender will have to pay a fine there. The punishment for drunk driving is six months of imprisonment or payment of a fine up to Rs.10,000 or both. If the offender is caught committing the offence a second time, he will have to face imprisonment of two years or a fine up to Rs.3,000 or both. After being issued a notice, the motorist will not be allowed to drive. He will have to leave his vehicle behind and take a cab home or call a friend or relative to drive him home. In case he wants to take the vehicle using the another person who is not drunk but is free to do so after leaving his original driving license and RC book under acknowledgement with the police officer. Very often motorists try to avoid legal proceedings by bribing the police officers concerned. However the best thing to do in such circumstances is to follow the proper procedures and not resort to corruption. Moreover if a person continues to drive under the influence of alcohol and gets involved in a fatal accident he will be booked for culpable homicide  which is a non bailable offence "]
        },
	{"tag": "limit",
         "patterns": ["How do I know how much can I drink to remain within permissible limit","what is the liquor limit to be consumed","how do i know how much should i drink to stay in limit"],
         "responses": ["There is no hard and fast rule as it depends on the body constitution, gender, whether liquor is taken on empty stomach or with the food or the duration over which liquor the consumed. Generally one bottle of beer / 30ml Whisky / Rum will keep the person below the permissible limit of 30 units. However, our metabolison burns about 10 units in an hour. And therefore, larger quantity consumed over longer duration will still keep the person within permissible limits. However, these measures are indicative in nature"]
        },
	{"tag": "reuse",
         "patterns": ["How do I know that the straw is not being reused","will the straw be reused","how to know whether the straw is not reused"],
         "responses": ["We have strict instructions to use disposable straw. You can insist on fresh straw to be taken out infront of you and destroy the straw after you have used it. One is also free to carry his own straw.","you can ask them to take out a new straw infront of you"]
        },
	{"tag": "2wheelers",
         "patterns": ["Can motorists use mobile phones while driving","Can 2 wheelers take a call while driving","is it ok for motorists to take a call while driving"],
         "responses": ["Motorists cannot use mobile phones while driving vehicles, and that includes two wheelers. There are no exceptions to this rule, not even doctors. If it's an emergency, the driver can park the vehicle on the side of the road and take the call."]
        },
	{"tag": "witness",
         "patterns": ["When people are involved in an accident or are witness to one, what should they do","i am witness to an accident what should i do","if i am involved in an accident what should i do"],
         "responses": ["If a motorist has caused the accident, he should arrange for medical aid and inform the police immediately. If a person is witness to an accident, he should help the victim and note down the details of the accused person before informing the police. Witnesses should not torch vehicles or indulge in anti social activities. The public should be pro active, not destructive"]
        },
	{"tag": "bmtc",
         "patterns": ["Why doesnt traffic police penalize BMTC bus drivers for violations","Are bmtc busses exempted for violations","will police punish bmtc busses incase of violations"],
         "responses": [" It is not true to say that BMTC buses are exempted from traffic enforcement and that only two wheeler drivers are penalised Firstly as against 43 lakh two wheelers there are only 6000 BMTC buses and hence enforcement of two wheelers is more visible due to sheer numbers. Statistically, whereas two wheelers constitute 73 percent of the total vehicle composition, the cases booked against two wheelers are only 41 percent of the total cases. Secondly, the mode of penalising buses is different from that of two wheelers. For traffic violation done by BMTC driver it will be extremely unfair to make 60 passengers suffer by delaying them. Moreover, stopping a BMTC bus even for five minutes can create huge traffic jam and chaos which will take hours to clear. Hence, BMTC buses are not stopped on the roads and instead the violations are noted and notices sent to the Depot Managers who recover the fine from their salary and deposit with traffic police. For the general information, in the year 2009, during first 10 months Rs.27 lakh was recovered from BMTC bus drivers alone as fine amount"]
        },
	{"tag": "target",
         "patterns": ["Does traffic police has any targets for collection of fine","will police have to collect fines to reach their target","is there any targrt for police to collect fines"],
         "responses": ["Ideally our target for fine collection should be zero since ultimate objective is to see that no one violates the traffic rules. We are neither a revenue earning department nor the amount collected has any correlation to departmental budget. Fine collected goes to the general revenue of the government. The fact that strict enforcement resulted in more than Rs.35 crore in 2009 is not a matter of pride for the department but the matter of shame and concern for all of us. We will be happy with fine collection going down if people were to follow rules. Unfortunately traffic violations are rampant especially when police men are not present. "]
        },
	{"tag": "crossing",
         "patterns": ["Why do policemen catch the people jumping the signal Why can’t they stand on the junction so that no one jumps the signal","does police dont have any alternatives stop people from crossing junction"],
         "responses": ["All over the world when one installs signals policemen are removed totally as people follow the signals themselves even at mid night. The scenario in our society is quite opposite. Red means stop, if the policeman is there red means nothing if policeman is not there. This is a sad reflection on our value system. Ideally, we would like to remove these police men from the signalized junctions and re-deploy them in the residential areas which are totally neglected. However, in the absence of self regulation this appears to be the distant dream. Traffic police catches people because they jump signals. Motorists should follow rules irrespective of presence and absence of police men. In the absence of sustainable attitudinal change, enforcement is the only deterrence against indiscipline on roads"]
        },
	{"tag": "overspeeding",
         "patterns": ["Why do traffic police catch vehicles for over speeding even when road is good and empty Why do they put a speed limit","road is clear and no one is there but police catched my vehicle stating over speed why is this"],
         "responses": ["Roads are not only for motorists but for all other road users including pedestrians who have to co-exist. Empty road is not a license to speed without limit because driver can not always anticipate sudden entry of some other road users. Roads are designed for a particular speed from safety point of view. Driving responsibly is an essential part of defensive driving which should take into account mistakes likely to be committed by other road users. Most of our roads pass through residential and commercial areas where sudden intrusions can not be ruled out. Speed limits are essential for defensive driving. "]
        },
	{"tag": "signal",
         "patterns": ["Why do we need signals","what is the need of traffic signals","traffic signals are meant for"],
         "responses": ["To avoid chaos and gridlocks, we need to regulate traffic. Rotaries are space sharing devices where traffic from each direction merges goes around the circle and weaves out. However, rotaries cannot function when PCU (a measure of vehicle density) exceeds 5000. Also rotaries require better discipline and awareness of rules regarding right of way on the part of road users.Beyond 5000 PCU we require signals which are time sharing devices allowing one stream of traffic at a time to avoid any merging, weaving and conflict. However, beyond 10,000 PCU, even signals become unmanageable due to abnormal increase in cycle time. We can still continue up to 12000 PCU by restricting few turning movements. Beyond 12000 PCU a grade separator is compulsorily required. Grade separators share space vertically and are the best solution for handling a junction with high PCU.Signals are essential part of traffic management in any city. It is neither feasible nor desirable to make grade separator at each junction. Essentially signals bring discipline. Moreover for the pedestrians these are the safest places for crossing the roads"]
        },
	{"tag": "oneway",
         "patterns": ["Why does police make one way","What is the need of one ways","What are one ways meant for","why do we need one ways"],
         "responses": ["One ways are made to overcome limited width (carriage way) of the road and to avoid frequent hold ups for right turn. For two way, every time traffic has to turn right, there arises a need for junction signalized or otherwise. For every right turning traffic has to stop traffic from opposite direction. By making one way, not only width problem is eliminated but also traffic can turn left and right without stopping. As a result, traffic continues to move without stopping.Contrary to the common perception, traffic police has not made any one way in past two years except for temporary purpose of metro or BBMP developmental works. In fact major roads have been made two ways like Sarjapur Road, Hosur Road, Palace Road etc. Widening and restrictions on right turns made it possible. "]
        },
	{"tag": "signalfree",
         "patterns": ["Why can’t we have signal free ride in the city","will we have a signal free ride","is it possible to have a ride without signals in the city "],
         "responses": ["With 44,000 junctions in the city, and high vehicle density, non-stop movement of traffic can only take place by providing grade separators. It may not be feasibly, practical or even advisable to have grade separator at every junction due to constraints of money and space. Hence, signals are inevitable. Moreover, for pedestrians signals are the only places for crossing the roads safety. All the cities in the world manage traffic using signals. Signaling system, however, can be made more efficient and logical. "]
        },
	{"tag": "cycle",
         "patterns": ["Why can’t signals clear entire traffic in one cycle","why do signals need many cycles to clear traffic","can't signals clear traffic in one cycle"],
         "responses": ["World over, time cycle (completing all 4 directions) does not exceed 180 sec. Due to excessive vehicle density, we have time cycles upto 200 sec. About 25 junctions in city have time cycles even upto 250 sec. This is not a healthy trend and our aim is to bring down upper limit to 200 sec. If time cycle is extended unlimited to clear complete traffic then it causes irritability to the other directions. If entire piled up traffic does not clear in one go, it is actually a problem of capacity of junction i.e. inadequacy of infrastructure and not the signaling system"]
        },
	{"tag": "receipt",
         "patterns": ["My vehicle was towed for wrong parking After release I was issued one receipt issued from Black Berry and another handwritten Why these two different receipts Is there something wrong","after my vehicle was towed i was given 2 receits why","what does it mean if i get 2 receits after my towed vehicle gets released"],
         "responses": ["All towing vehicles run under PPP model. The Black Berry receipt comprise of parking violations fine and government component of towing charges. This amount is remitted to the government. The manual receipt reflects the private component of towing charges which is paid to a person who owns the towing vehicle. There is no leakage in this system"]
        },
	{"tag": "language",
         "patterns": ["Why don’t traffic police speak Englist or Hindi I cannot follow Kannada","I dont know kannada and traffic police here are not speaking in hindi or english why","What should i do if i have language problem with police"],
         "responses": ["While traffic policemen are trained to speak basic words in English as well as Hindi let us not forget that their mother tongue as well as official language is Kannada. They cannot be expected to converse in English, Hindi or any other language as a matter of right. However, they are being trained in soft skills. On the contrary, if you are long-term resident of Bengaluru, there is no harm in picking up a bit of Kannada. Life will be much simpler"]
        },
	{"tag": "ignition",
         "patterns": ["When stopped for a traffic violation why do traffic cops move ignition key","i was asked to stop my vehicle for violation and police had moved an ignition key why is this","why police move ignition key to stop a vehicle"],
         "responses": ["It is not a good practice and we do not approve of it. However, let us not forget that large number of violators try to run away when detained by traffic police some even endangering life of policemen while trying to run over them. You are certainly not the one like them but many others are."]
        },
	{"tag": "overcharged",
         "patterns": ["How do I know that I am not being overcharged","i am imposed fine and how to know whether i am paying correct amount or i am overcharged","How to know whether i am paying the exact fine or not"],
         "responses": ["Fine for most offences is Rs.500 for over speeding and using mobile phone is Rs.1000 & for drunk & Driving up to Rs.10,000/- (through court only). However, each officer has a black berry and if you insist on proper receipt there is no scope for you being overcharged. Insist on black berry receipt."]
        },
	{"tag": "shelters",
         "patterns": ["Why dont police shift bus shelters away from junctions","why are junctions near bus shelters","cant police shift junctions away from shelters of bus"],
         "responses": ["Firstly installation or removal bus shelters does not come under the perview of traffic police. Unfortunately, each of the bus shelter is a revenue spinner through advertisements for the agency which installs these.But we have taken initiatives to shift this bus shelters without much success.Where as there is complete consensus among citizens as to where bus shelters should not be there is no consensus as to where it should be installed as no residents, no shop keeper, no establishments wants it in front of their establishment or residence.Hence, there is complete consensus about the problem but none about solution.Moreover Bengaluru has a peculiarity of having junctions so close that many times it is difficult to find locations for shelters which would be away from junctions on both the sides.We are focusing on not to let them commit mistake in future.However correcting the historical legacy appears difficult at the moment.But buses stops even where there is no bus shelter that is beginning of all the flyovers because people stand and wait there.So it is not an issue of shelters, bus drivers but much beyond that is citizens"]
        },
	{"tag": "damage",
         "patterns": ["A driver hit and drove away damaging my vehicle How do I claim insurance","if my is hit by someone can i get insurance","how to claim insurance if my car was hit and damaged"],
         "responses": ["In case of minor damage and you want to take claim from your own insurance because you have not noted the number of other vehicle or you don't want to persue it, go to the police station, ask for a SHD entry and acknowledgement and it will help you in claiming insurance. In case you want other's insurance to pay for the repairs, get FIR and after the case is charge sheeted, file a claim. But in this case the number of the other vehicle should be known."]
        },
	{"tag": "left",
         "patterns": ["Why free left is not provided at all the junctions","i wanted to take left from a junction but i couldnt do it freely why","free lefts are not allowed at junctions why"],
         "responses": ["Providing or prohibiting free left depends on the width of both merging & demerging roads free left has no meaning if it is merely one or two lane road since the turning traffic will conflict with straight coming traffic. Wherever there is adequate road width for merging or wherever chanelising islands are provided free left can be given. Also free left impinges on the rights of pedestrians to cross the road safely. Therefore, wherever pedestrian crossing movement is heavy free left cannot be provided.Scenario is quite different in advanced countries where free left is always provided because roads are four to five lane vide in each directions and drivers display exemplary ettiquettes by stopping whenever pedestrians is crossing. If we had such etiquettes on the roads providing free left would not have been difficult. However, that is not the scenario in reality. Hence, it is difficult to provide free left on all the roads in Bengaluru."]
        },
	{"tag": "freeleft",
         "patterns": ["How do you know whether there is free left or not","i want to take a free left how do i know whether i can or not","will there be a board stating there will be a free left"],
         "responses": ["There are two ways Look for road signage, saying “free left prohibited “which obviously means that one cannot take free left turn. Secondly, look at the traffic signals. If there is a dedicated signal for taking left then you should wait for that signal to turn green and it means that free left is not available"]
        },
	{"tag": "transfer",
         "patterns": ["What is the process for transferring a vehicle from one state to another","how to change a vehicle from one state to other","What is the procedure for vehicle change from state to state"],
         "responses": ["While transferring a vehicle (car/bike) from one   state to another , first NOC is required from the RTO  where vehicle is registered .  To  register the vehicle  in the  RTO of  transferred state  one will have to pay the road tax other than  submitting NOC , RC ,Insurance and address proof."]
        },
	{"tag": "noc",
         "patterns": ["What are the documents required  for No Objection Certificate NOC for vehicle transfer","Which documents do i need for NOC","Which documents are expected for NOC"],
         "responses": ["Application on Form 28, Original RC,Upto date payment of Road tax, Valid insurance,Crime  Report of N.C.R.B,Copy of address proof "]
        },
	{"tag": "register",
         "patterns": ["Can I drive my vehicle without registering it in the state where I have been transferred","I have got transferred to other state can i drive without registering my vehicle","am i allowed to drive my vehicle without registering it the state i have transferred"],
         "responses": ["No , legally its not permitted","NO","you must register it","you are not permitted to drive without registering your vehicle"]
        },
	{"tag": "tax",
         "patterns": ["How much Road tax I will have to pay in the state where I am taking my vehicle","how much will be the road tax for my vehicle","how much does road tax cost"],
         "responses": ["It varies from state to state","Normally  it is in the range of 10 percent of vehicle value ","it depends on the state you are in"]
        },
	{"tag": "Hypothetication",
         "patterns": ["What is the procedure for HP Hypothecation deletion","how is Hypothetication deletion done","what is the process of Hypothetication deletion"],
         "responses": ["If a vehicle is purchased on loan from a financier , once loan is repaid completely ,  the same could be endorsed in the registration certificate and following are the documents required Registration certificate in original,Dully filled  Form no. 35,A certificate from financier for having retained full dues from the financier (for deletion case only),Copy of valid insurance,Copy of address proof of the registered owner,Copy of valid pollution under control certificate,Attested copy of PAN Card or Form 60 & 61(as applicable)"]
        },
	{"tag": "ownership",
         "patterns": ["What is the process for ownership transfer of a vehicle","I have sold my vehicle now how should i change ownership","what is the procedure to change ownership from one to other"],
         "responses": ["The transfer of ownership of a vehicle is to be applied in the concerned zonal office where vehicle is already registered and following are the documents to be submitted Original RC,Dully filled   Form no.29,Dully filled  Form no.30,Copy of valid insurance certificate,Attested copy of address proof of purchaser,Attested copy of valid Pollution Under Control Certificate,Attested copy of PAN Card or Form 60 & 61(as applicable)"]
        },
	{"tag": "duplicate",
         "patterns": ["What is the process for  issue of duplicate RC ","What should i do to get a duplicate RC","I want a duplicate RC what is the procedure to be followed"],
         "responses": [" In case the original RC  is either lost or mutilated  ,registered owner can apply for a duplicate RC  after submitting following  documents Application on form 26  along with the endorsement from the financier of Hypothecated,Original copy of the F.I.R/N.C.R.,Copy of valid insurance policy,Copy of pollution under control certificate.,Copy of address proof,Copy of PAN Card or Form 60 & 61(as applicable)"]
        },
	{
            "tag": "onlineTicketIssue",
            "patterns": [
                "What shall I do if I face any problem, while booking ticket online",
                "problem while booking online ticket",
                "online ticket booking issue",
                "how can i solve the problem while booking ticket online",
                "had a problem while booking ticket online"
            ],
            "responses": [
                "You can contact 9449596666 (Call center – 24 hours) or 7760990034 / 7760990035 (Awatar Cell between 0700 and 2200 hrs) for any booking related query/assista...",
                "Contact: 9449596666 or 7760990034 / 7760990035",
                "Helpline : 9449596666 or 7760990034 / 7760990035 for all booking issues"
            ],
            "context_set": "online ticket"
        },
        {
            "tag": "ticketCancellation",
            "patterns": [
                "How can I lodge a complaint regarding Operation/Cancellation of Service",
                "how can i complain about cancellation of a service",
                "complain regarding cancellation of ticket"
            ],
            "responses": [
                "You can send an email to awatar@ksrtc.org through the mail ID in which you have booked a ticket.",
                "Sorry for the inconvinience. Contact : awatar@ksrtc.org through mail",
                "Sorry for the inconvinience. Mail to : awatar@ksrtc.org"

            ],
            "context_set": "complain"
        },
        {
            "tag": "childFare",
            "patterns": [
                "What is the age criteria for Child Fare?",
                "Is child fare valid for 8 years old",
                "age of child to be eligible for child fare",
                "valid age for child fare"
            ],
            "responses": [
                "Children up to the age of 6 years (<= 6 years) are allowed to travel free",
                "Children with age less than 6 years can travel for free",
                "Infants and Children younger than 6 years can travel for free"
            ],
            "context_set": "child fare"
        },
        {
            "tag": "lostTicket",
            "patterns": [
                "I have lost my e-ticket / counter ticket. What should I do now ?",
                "What to do when I lose my ticket",
                "what do i do when i lost e-ticket",
                "who to approach if lost my ticket",
                "what to do if i lost my ticket"

            ],
            "responses": [
                "You can generate your e-ticket online, visit www.ksrtc.in => Go to “PNR Enquiry” of Homepage => provide PNR number and Mobile number => click on select",
                "Generate your ticket again by navigating to www.ksrtc.in website => PNR Enquiry => Provide your details => Select"
            ],
            "context_set": "lose ticket"
        },
        {
            "tag": "lostTicket",
            "patterns": [
                "I have lost my e-ticket / counter ticket. What should I do now ?",
                "What to do when I lose my ticket",
                "what do i do when i lost e-ticket",
                "who to approach if lost my ticket",
                "what to do if i lost my ticket"

            ],
            "responses": [
                "You can generate your e-ticket online, visit www.ksrtc.in => Go to “PNR Enquiry” of Homepage => provide PNR number and Mobile number => click on select",
                "Generate your ticket again by navigating to www.ksrtc.in website => PNR Enquiry => Provide your details => Select"
            ],
            "context_set": "lose ticket"
        },
        {
            "tag": "idproof",
            "patterns": [
                "Is it mandatory to carry ID proof for e-ticket",
                "do i have to carry id proof for e-ticket",
                "is it compulsory to have id proof for e ticket",
                "is it necessary to have aadhar or any id proof for e ticket",
                "should i have id proof for e-ticket"

            ],
            "responses": [
                "Yes. It is a must to carry photo ID proof [Driving License, Voter ID Card, PAN Card, Passport, AADHAR Card, Ration Card (with passenger photo)",
                "Yes. Any photo id proof is mandatory",
                "Yes. Any official id proof (Aadhar, Driving License or Pan Card) is necessary"
            ],
            "context_set": "id proof"
        },
        {
            "tag": "failedTransaction",
            "patterns": [
                "Amount debited but ticket is not confirmed (failed transaction), what should I do?",
                "money is cut from account but ticket is not issued",
                "transaction failed ticket not issued",
                "money debited from account but ticket is not generated",
                "transaction failed when will my money return",
                "transaction failed when is money going to get refunded"
            ],
            "responses": [
                "the refund will be processed within 7 working days. For further queries contact : onlinerefund@ksrtc.org",
                "Amount will be refunded back within 7 working days. Sorry for the inconvinience. For further queries contact : onlinerefund@ksrtc.org ",
                "Sorry for the trouble. Amount will be refunded within 7 working days. For further queries contact : onlinerefund@ksrtc.org"
            ],
            "context_set": "transaction fail"
        },
        {
            "tag": "successfulTransaction",
            "patterns": [
                "How do I know about the successful transaction",
                "will i get a confirmation for a successful transaction",
                "how do i know if a transaction is successful"
            ],
            "responses": [
                "Visit www.ksrtc.in => Go to “PNR Enquiry” section of Menu => click on “Transaction Status” to know details of successful / failure transaction",
                "Visit www.ksrtc.in => Go to “PNR Enquiry” section of Menu => click on “Transaction Status” to know details of successful / failure transaction"
            ],
            "context_set": "transaction success"
        },
        {
            "tag": "cost",
            "patterns": [
                "Does booking online (e-booking) cost me more?",
                "is e-ticket more expensive",
                "is booking online more costly",
                "is e-booking expensive"
            ],
            "responses": [
                "No. The price is same as counter booking",
                "No. For e-bookings (e-ticket) we charge the same as Counter booking.",
                "No. There is no difference in cost compared to counter booking."
            ],
            "context_set": ["costly","online ticket expensive"]
        },
        {
            "tag": "registration",
            "patterns": [
                "Do I need to register to book online (e-ticket)?",
                "Should i register to book online",
                "should i have an account to register online",
                "should i register in the webiste to book online ticket",
                "do i need to create an account to book ticket online"
            ],
            "responses": [
                "Registration is not mandatory",
                "Both Options provided on www.ksrtc.in, with registration (Registered Users) and without registration (Guest user).",
                "You can book as a guest user if you do not have an account."
            ],
            "context_set": "register"
        }

        
   ]
}